Revit 2026 API

# NurbSplineCreateCurve(Int32, IListDouble, IListXYZ, IListDouble) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Curve CreateCurve(
	int degree,
	IList<double> knots,
	IList<XYZ> controlPoints,
	IList<double> weights
)
```
```vb
Public Shared Function CreateCurve (
	degree As Integer,
	knots As IList(Of Double),
	controlPoints As IList(Of XYZ),
	weights As IList(Of Double)
) As Curve
```
```cpp
public:
static Curve^ CreateCurve(
	int degree,
	IList<double>^ knots,
	IList<XYZ^>^ controlPoints,
	IList<double>^ weights
)
```
```fsharp
static member CreateCurve :
        degree : int *
        knots : IList<float> *
        controlPoints : IList<XYZ> *
        weights : IList<float> -> Curve
```

#### Parameters

degree Int32

knots IListDouble

controlPoints IListXYZ

weights IListDouble

#### Return Value

Curve

#### Reference

NurbSpline Class

CreateCurve Overload

Autodesk.Revit.DB Namespace